<?php

return [

    /*
    |--------------------------------------------------------------------------
    | المصادقة والعام
    |--------------------------------------------------------------------------
    */
    'dashboard' => 'لوحة التحكم',
    'home' => 'الرئيسية',
    'about' => 'من نحن',
    'contact' => 'اتصل بنا',
    'signin' => 'تسجيل الدخول',
    'login' => 'دخول',
    'register' => 'تسجيل',
    'logout' => 'تسجيل الخروج',
    'hello' => 'مرحبا',
    'email' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'confirm_password' => 'تأكيد كلمة المرور',
    'notifications' => 'الإشعارات',
    'search' => 'بحث',
    'search_in_site' => 'ابحث في الموقع',
    'follow_us' => 'تابعنا',
    'hotline' => 'الخط الساخن',
    'all' => 'الكل',

    /*
    |--------------------------------------------------------------------------
    | المستخدمين
    |--------------------------------------------------------------------------
    */
    'users' => 'المستخدمين',
    'roles' => 'الصلاحيات',
    'create_user' => 'انشاء مستخدم جديد',
    'user_name' => 'اسم المستخدم',
    'first_name' => 'الاسم الأول',
    'last_name' => 'الاسم الأخير',
    'create_role' => 'انشاء دور ',
    'permissions_management' => 'ادارة الصلاحيات  ',

    /*
    |--------------------------------------------------------------------------
    | العمليات العامة
    |--------------------------------------------------------------------------
    */
    'create' => 'إنشاء',
    'show' => 'عرض',
    'edit' => 'تعديل',
    'update' => 'تحديث',
    'delete' => 'حذف',
    'deleted_at' => 'حذف',
    'force_delete' => 'حذف نهائي',
    'restore' => 'استرجاع',
    'trash' => 'سلة المحذوفات',
    'save' => 'حفظ',
    'save_changes' => 'حفظ التغييرات',
    'cancel' => 'إلغاء',
    'filter' => 'تصفية',
    'remove' => 'إزالة',
    'new' => 'جديد',
    'actions' => 'الإجراءات',

    /*
    |--------------------------------------------------------------------------
    | المنتجات
    |--------------------------------------------------------------------------
    */
    'shop' => 'المتجر',
    'categories' => 'الأقسام',
    'category' => 'قسم',
    'brands' => 'العلامات التجارية',
    'brand' => 'العلامة التجارية',
    'parent' => 'الأب',
    'products' => 'المنتجات',
    'product_name' => 'اسم المنتج',
    'product_image' => 'صورة المنتج',
    'product_details' => 'تفاصيل المنتج',
    'products_count' => 'عدد المنتجات',
    'product_type' => 'نوع المنتج',
    'stock' => 'المخزون',
    'in_stock' => 'متوفر',
    'out_of_stock' => 'غير متوفر',
    'price' => 'السعر',
    'compare_price' => 'سعر المقارنة',
    'discount' => 'الخصم',
    'quantity' => 'الكمية',
    'total_quantity' => 'إجمالي الكمية',
    'trending_products' => 'منتجات رائجة',
    'product_variations' => ' سمات المنتج',
    'attributes' => 'الخصائص',
    'values' => 'القيم',
    'attribute_values' => ' قيم السمات',
    'add_attribute' => ' اضافة سمة',
    'select_attribute' => ' اختر سمة',
    'simple' => 'بسيط',
    'variable' => 'متغير',
    'sku' => 'كود المنتج',
    'thumbnail' => 'الصورة الرئيسية',
    'gallery' => 'الكتالوج ',
    'images' => 'الصور',
    'variants' => 'المتغيرات',
    'no_products_defined' => 'لا يوجد منتجات',
    'no_categories_defined' => 'لا يوجد أقسام',
    'no_brands_defined' => 'لا يوجد علامات تجارية ',
    'no_attributes_defined' => 'لا يوجد سمات متاحة ',
    'no_orders_defined' => 'لا يوجد طلبات متاحة ',
    'latest_reviews'=> ' أخر التقييمات',
    'leave_review' => ' اترك تقييم',
    'generate_variants'=>' انشاء المتغيرات ',
    'confirm_delete' => 'تأكيد الحذف',
    'add_to_favorites' => 'أضف إلى المفضلة',
    'governorate' => 'المحافظة',


    /*
    |--------------------------------------------------------------------------
    | السلة والدفع
    |--------------------------------------------------------------------------
    */
    'cart' => 'السلة',
    'view_cart' => 'عرض السلة',
    'add_to_cart' => 'إضافة إلى السلة',
    'subtotal' => 'الإجمالي الفرعي',
    'total' => 'الإجمالي',
    'cart_total' => 'اجمالى السلة ',
    'tax' => 'الضريبة',
    'coupons' => 'كوبونات',
    'checkout' => 'اتمام الطلب',
    'favorites' => 'المفضلة',

    /*
    |------------------------------------------------- -------------------------
    | الطلبات
    |--------------------------------------------------------------------------
    */
    'orders' => 'الطلبات',
    'order_number' => 'رقم الطلب',
    'order_status' => 'حالة الطلب',
    'customer_name' => 'اسم العميل',
    'customer' => 'العميل',
    'total_price' => 'السعر الإجمالي',
    'payment_method' => 'طريقة الدفع',
    'payment_status' => 'حالة الدفع',
    'shipping_price' => 'سعر الشحن',
    'shipping' => 'الشحن',
    'shipping_status' => 'حالة الشحن',
    'shipping_address' => 'عنوان الشحن',
    'delivery_days' => 'أيام التوصيل',
    'governorates' => 'المحافظات',
    'phone' => 'الهاتف',
    'update_status' => 'تحديث الحالة',
    'date' => 'التاريخ',
    'from' => 'من',
    'to' => 'إلى',

    /*
    |--------------------------------------------------------------------------
    | المدونة
    |--------------------------------------------------------------------------
    */
    'blog' => 'المدونة',
    'create_post' => 'المدونة',
    'posts' => 'المقالات',
    'title' => 'العنوان',
    'content' => 'المحتوى',
    'author' => 'الكاتب',
    'published' => 'منشور',
    'edit_post' => 'تعديل المقال',
    'tags' => 'الوسوم',
    'read_more' => 'اقرأ المزيد',
    'featured_posts' => 'مقالات مميزة',
    'our_latest_news' => 'آخر الأخبار',
    'comments' => 'التعليقات',
    'leave_comment' => 'اترك تعليق',
    'post_comment' => 'نشر التعليق',
    'submit_reply' => 'نشر الرد',
    'no_comments_yet' => 'لا توجد تعليقات بعد',
    'reviews' => 'التقييمات',
    'review' => 'تقييم',
    'images' => 'الصور',
    'no_posts_defined' => 'لا يوجد مقالات متاحة',
    'share_post' => 'مشاركة المقال',

    /*
    |--------------------------------------------------------------------------
    | الحالات
    |--------------------------------------------------------------------------
    */
    'status' => 'الحالة',
    'active' => 'نشط',
    'inactive' => 'غير نشط',
    'archived' => 'مؤرشف',
    'draft' => 'مسودة',
    'pending' => 'قيد الانتظار',
    'processing' => 'قيد التنفيذ',
    'completed' => 'مكتمل',
    'canceled' => 'ملغي',
    'refunded' => 'مسترجع',
    'returned' => 'مرتجع',
    'shipped' => 'تم الشحن',
    'delivered' => 'تم التسليم',
    'available' => 'متاح',
    'unavailable' => 'غير متاح',

    /*
    |--------------------------------------------------------------------------
    | بيانات عامة
    |--------------------------------------------------------------------------
    */
    'name' => 'الاسم',
    'description' => 'الوصف',
    'created_at' => 'تاريخ الإنشاء',
    'updated_at' => 'تاريخ التحديث',
    'updated_by' => 'تم التحديث بواسطة',
    'reply'=> 'رد',

    /*
    |--------------------------------------------------------------------------
    | الكوبونات و الدفع
    |--------------------------------------------------------------------------
    */
    'create_coupon'=> 'انشاء كود خصم',

    'coupon_code' => 'كود الخصم',
    'type' => 'النوع',
    'value' => 'القيمة',
    'fixed_amount' => 'مبلغ ثابت',
    'percentage' => 'نسبة مئوية',
    'usage_limit' => 'حد الاستخدام',
    'used_count' => 'عدد مرات الاستخدام',
    'expiry_date' => 'تاريخ الانتهاء',
    'active_status' => 'الحالة',
    'no_coupons_defined' => 'لا يوجد كوبونات حالياً ',


    /*
    |--------------------------------------------------------------------------
    | حقول الدفع
    |--------------------------------------------------------------------------
    */
    'email_address' => 'البريد الإلكتروني',
    'phone_number' => 'رقم الهاتف',
    'street_address' => 'العنوان',
    'city' => 'المدينة',
    'country' => 'الدولة',
    'apply_coupon' => 'تطبيق الكوبون',
    'pricing_table' => 'جدول الأسعار',
    'subtotal_price' => 'الإجمالي الفرعي',
    'total_payable' => 'الإجمالي المستحق',
    'see_all_notifications' => 'عرض كل الإشعارات',
    'choose_governorate' => 'اختر المحافظة'

];